# ============================================================
# Yandex Cloud — общие параметры
# ============================================================

yc_token        = "<yc-token>"
yc_cloud_id     = "<yc-cloud_id>"
yc_folder_id    = "<yc-folder_id>"
yc_default_zone = "ru-central1-a"
project_prefix  = "future20"

# ============================================================
# SSH и доступ
# ============================================================

ssh_public_key = "<ssh-key>"
admin_cidr     = "203.0.113.0/24"

# ============================================================
# PostgreSQL
# ============================================================

pg_resource_preset = "s2.micro"
pg_disk_size       = 50
pg_password        = "odLNPzCenvt0b6cR"

# ============================================================
# Kafka
# ============================================================

kafka_brokers_count   = 1
kafka_resource_preset = "s2.micro"
kafka_disk_size       = 32

# ============================================================
# ClickHouse
# ============================================================

ch_resource_preset = "s2.micro"
ch_disk_size       = 32
ch_password        = "aOLL9nhV2O6Qwy48"
